In [3]:
! pip install sqlalchemy
! pip install pyMysql

Requirement already satisfied: sqlalchemy in e:\study\ml\anaconda\lib\site-packages (1.2.15)
Collecting pyMysql
  Using cached https://files.pythonhosted.org/packages/ed/39/15045ae46f2a123019aa968dfcba0396c161c20f855f11dea6796bcaae95/PyMySQL-0.9.3-py2.py3-none-any.whl
Installing collected packages: pyMysql
Successfully installed pyMysql-0.9.3

In [1]:
import pandas as pd
import sqlalchemy

In [2]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:suman@localhost:3306/mysql')

In [3]:
df=pd.read_sql_table('EMPLOYEE',engine)

ValueError: Table EMPLOYEE not found

In [4]:
df=pd.read_sql_table('employee',engine) # table name should be in lowere case if read_sql_table is used

In [5]:
df

   EMP_ID EMP_NAME   DOJ_DATE  DEPT_ID  STATUS
0       1    VIVEK 2018-01-02        1  ACTIVE
1       2  pRADEEP 2019-05-02        2  ACTIVE
2       3    MOHAN 2019-01-02        2  ACTIVE
3       4    rocky 2016-02-04        2  active
4       5   nikhil 2016-05-07        1  active

In [18]:
df2=pd.read_sql_table('department',engine)

In [11]:
df2

   DEPT_ID   DEPT_NAME  STATUS
0        1  TECHNOLOGY  ACTIVE
1        2     FINANCE  ACTIVE

In [13]:
pd.read_sql_table('employee',engine,columns=["EMP_NAME"])

  EMP_NAME
0    VIVEK
1  pRADEEP
2    MOHAN

In [15]:
pd.read_sql("SELECT * FROM EMPLOYEE;",engine)

   EMP_ID EMP_NAME    DOJ_DATE  DEPT_ID  STATUS
0       1    VIVEK  2018-01-02        1  ACTIVE
1       2  pRADEEP  2019-05-02        2  ACTIVE
2       3    MOHAN  2019-01-02        2  ACTIVE

In [19]:
help(pd.read_sql_table)

Help on function read_sql_table in module pandas.io.sql:

read_sql_table(table_name, con, schema=None, index_col=None, coerce_float=True, parse_dates=None, columns=None, chunksize=None)
    Read SQL database table into a DataFrame.

    Given a table name and a SQLAlchemy connectable, returns a DataFrame.
    This function does not support DBAPI connections.

    Parameters
    ----------
    table_name : string
        Name of SQL table in database.
    con : SQLAlchemy connectable (or database string URI)
        SQLite DBAPI connection mode not supported.
    schema : string, default None
        Name of SQL schema in database to query (if database flavor
        supports this). Uses default schema if None (default).
    index_col : string or list of strings, optional, default: None
        Column(s) to set as index(MultiIndex).
    coerce_float : boolean, default True
        Attempts to convert values of non-string, non-numeric objects (like
        decimal.Decimal) to floating point. Can result in loss of Precision.
    parse_dates : list or dict, default: None
        - List of column names to parse as dates.
        - Dict of ``{column_name: format string}`` where format string is
          strftime compatible in case of parsing string times or is one of
          (D, s, ns, ms, us) in case of parsing integer timestamps.
        - Dict of ``{column_name: arg dict}``, where the arg dict corresponds
          to the keyword arguments of :func:`pandas.to_datetime`
          Especially useful with databases without native Datetime support,
          such as SQLite.
    columns : list, default: None
        List of column names to select from SQL table
    chunksize : int, default None
        If specified, returns an iterator where `chunksize` is the number of
        rows to include in each chunk.

    Returns
    -------
    DataFrame

    Notes
    -----
    Any datetime values with time zone information will be converted to UTC.

    See also
    --------
    read_sql_query : Read SQL query into a DataFrame.
    read_sql

In [59]:
query='''select a.emp_name from employee a inner  join department b on a.dept_id=b.dept_id where dept_name='Technology';'''

In [62]:
pd.read_sql_query(query,engine)

  emp_name
0    VIVEK

In [ ]:
pd.read_sql(query,engine)

In [71]:
df=pd.read_csv("dept.csv")

In [72]:
df

     name         doj  departmentid  status
0   rocky  2016-02-04             2  active
1  nikhil  2016-05-07             1  active

In [73]:
df.rename(columns={'name':'EMP_NAME','doj':'DOJ_DATE',"departmentid":"DEPT_ID",'status':'STATUS'},inplace=True)

In [74]:
df

  EMP_NAME    DOJ_DATE  DEPT_ID  STATUS
0    rocky  2016-02-04        2  active
1   nikhil  2016-05-07        1  active

In [75]:
df.to_sql(name="EMPLOYEE",
         con=engine,
         if_exists='append',
         index=False
         )

E:\Study\ML\Anaconda\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'EMPLOYEE' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)